spirit0908/STM32/main.c
/*******************************************************************************
 * Function Name  : I2C1Init
 * Description    : Initializes the I2C 1 link.
 * Input          : None
 * Output         : None
 * Return         : None
 *******************************************************************************/
void I2C1Init(void)
{
    I2C_InitTypeDef  I2C_InitStructure;
    GPIO_InitTypeDef  GPIO_InitStructure;

    RCC_APB1PeriphClockCmd(RCC_APB1Periph_I2C1, ENABLE);

    /* Configure I2C_EE pins: SCL and SDA */
//  GPIO_InitStructure.GPIO_Pin =  GPIO_Pin_6 | GPIO_Pin_7;
    GPIO_InitStructure.GPIO_Pin =  GPIO_Pin_8 | GPIO_Pin_9;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_OD;
    GPIO_Init(GPIOB, &GPIO_InitStructure);

    /* I2C configuration */
    I2C_InitStructure.I2C_Mode = I2C_Mode_I2C;
    I2C_InitStructure.I2C_DutyCycle = I2C_DutyCycle_2;
    I2C_InitStructure.I2C_OwnAddress1 = 0x38;
    I2C_InitStructure.I2C_Ack = I2C_Ack_Enable;
    I2C_InitStructure.I2C_AcknowledgedAddress = I2C_AcknowledgedAddress_7bit;
    I2C_InitStructure.I2C_ClockSpeed = 100000;

    /* I2C Peripheral Enable */
    I2C_Cmd(I2C1, ENABLE);
    /* Apply I2C configuration after enabling it */
    I2C_Init(I2C1, &I2C_InitStructure);

    GPIO_PinRemapConfig(GPIO_Remap_I2C1, ENABLE); //Remap I2C1 to use PB8 and PB9
}


/*******************************************************************************
 * Function Name  : CanInit
 * Description    : Initializes the CAN controller module.
 * Input          : None
 * Output         : None
 * Return         : None
 *******************************************************************************/
void CanInit(void)
{
    CAN_InitTypeDef CAN_InitStruct;

    /* Enable CAN clock */
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_CAN, ENABLE);
    GPIO_PinRemapConfig(GPIO_Remap1_CAN, DISABLE);
    GPIO_PinRemapConfig(GPIO_Remap2_CAN, DISABLE);

    /* Enable USART  */
    CAN_StructInit(&CAN_InitStruct);
//    CAN_Cmd(CAN, ENABLE);
    CAN_Init(&CAN_InitStruct);

    //Configure CAN
    CAN_StructInit(&CAN_InitStruct);

    /* CAN cell init */
    CAN_InitStruct.CAN_TTCM = DISABLE;
    CAN_InitStruct.CAN_ABOM = DISABLE;
    CAN_InitStruct.CAN_AWUM = DISABLE;
    CAN_InitStruct.CAN_NART = DISABLE;
    CAN_InitStruct.CAN_RFLM = DISABLE;
    CAN_InitStruct.CAN_TXFP = DISABLE;
    CAN_InitStruct.CAN_Mode = CAN_Mode_Normal;

//  /* CAN Baudrate = 250kbps */
//  /* not working */
//  CAN_InitStruct.CAN_SJW = CAN_SJW_1tq;
//  CAN_InitStruct.CAN_BS1 = CAN_BS1_3tq;
//  CAN_InitStruct.CAN_BS2 = CAN_BS2_5tq;
//  CAN_InitStruct.CAN_Prescaler = 4;
//
//  /* CAN Baudrate = 500kbps */
    /* not working */
//  CAN_InitStruct.CAN_SJW = CAN_SJW_1tq;
//  CAN_InitStruct.CAN_BS1 = CAN_BS1_5tq;
//  CAN_InitStruct.CAN_BS2 = CAN_BS2_2tq;
//  CAN_InitStruct.CAN_Prescaler = 1;


#if (CAN_BAUDRATE == CAN_BAUDRATE_10KBPS)
    /* Not tested */
    //  /* CAN Baudrate = 10kbps */
    CAN_InitStruct.CAN_SJW = CAN_SJW_1tq;
    CAN_InitStruct.CAN_BS1 = CAN_BS1_3tq;
    CAN_InitStruct.CAN_BS2 = CAN_BS2_5tq;
    CAN_InitStruct.CAN_Prescaler = 400;
#elif CAN_BAUDRATE == CAN_BAUDRATE_20KBPS
    //  /* CAN Baudrate = 20kbps */
    CAN_InitStruct.CAN_SJW = CAN_SJW_1tq;
    CAN_InitStruct.CAN_BS1 = CAN_BS1_3tq;
    CAN_InitStruct.CAN_BS2 = CAN_BS2_5tq;
    CAN_InitStruct.CAN_Prescaler = 200;
#elif CAN_BAUDRATE == CAN_BAUDRATE_50KBPS
    //  /* CAN Baudrate = 50kbps */
    CAN_InitStruct.CAN_SJW = CAN_SJW_1tq;
    CAN_InitStruct.CAN_BS1 = CAN_BS1_3tq;
    CAN_InitStruct.CAN_BS2 = CAN_BS2_5tq;
    CAN_InitStruct.CAN_Prescaler = 80;
#elif CAN_BAUDRATE == CAN_BAUDRATE_100KBPS
    //  /* CAN Baudrate = 100kbps */
    CAN_InitStruct.CAN_SJW = CAN_SJW_1tq;
    CAN_InitStruct.CAN_BS1 = CAN_BS1_3tq;
    CAN_InitStruct.CAN_BS2 = CAN_BS2_5tq;
    CAN_InitStruct.CAN_Prescaler = 40;
#elif CAN_BAUDRATE == 125
    //  /* CAN Baudrate = 125kbps */
    CAN_InitStruct.CAN_SJW = CAN_SJW_1tq;
    CAN_InitStruct.CAN_BS1 = CAN_BS1_3tq;
    CAN_InitStruct.CAN_BS2 = CAN_BS2_5tq;
    CAN_InitStruct.CAN_Prescaler = 32;
#elif CAN_BAUDRATE == CAN_BAUDRATE_250KBPS
    //  /* CAN Baudrate = 250kbps */
    CAN_InitStruct.CAN_SJW = CAN_SJW_1tq;
    CAN_InitStruct.CAN_BS1 = CAN_BS1_3tq;
    CAN_InitStruct.CAN_BS2 = CAN_BS2_5tq;
    CAN_InitStruct.CAN_Prescaler = 16;
#elif CAN_BAUDRATE == CAN_BAUDRATE_500KBPS
    //  /* CAN Baudrate = 500kbps */
//  CAN_InitStruct.CAN_SJW = CAN_SJW_1tq;
//  CAN_InitStruct.CAN_BS1 = CAN_BS1_3tq;
//  CAN_InitStruct.CAN_BS2 = CAN_BS2_5tq;
//  CAN_InitStruct.CAN_Prescaler = 8;

    /* CAN Baudrate = 500kbps */
    /* or: system clock = 72MHz (PCLK1 = 36 MHz) */
    CAN_InitStruct.CAN_SJW = CAN_SJW_1tq;
    CAN_InitStruct.CAN_BS1 = CAN_BS1_8tq;
    CAN_InitStruct.CAN_BS2 = CAN_BS2_3tq;
    CAN_InitStruct.CAN_Prescaler = 6;
#elif CAN_BAUDRATE == CAN_BAUDRATE_1MPBS
    /* CAN Baudrate = 1MBps */
    CAN_InitStruct.CAN_SJW = CAN_SJW_1tq;
    CAN_InitStruct.CAN_BS1 = CAN_BS1_3tq;
    CAN_InitStruct.CAN_BS2 = CAN_BS2_5tq;
    CAN_InitStruct.CAN_Prescaler = 4;
#endif

    CAN_Init(&CAN_InitStruct);

      /* CAN filter init */
//  #ifdef  __CAN1_USED__
      CAN_FilterInitStructure.CAN_FilterNumber = 0;
//  #else /*__CAN2_USED__*/
//    CAN_FilterInitStructure.CAN_FilterNumber = 14;
//  #endif  /* __CAN1_USED__ */
      CAN_FilterInitStructure.CAN_FilterMode = CAN_FilterMode_IdMask;
      CAN_FilterInitStructure.CAN_FilterScale = CAN_FilterScale_32bit;
      CAN_FilterInitStructure.CAN_FilterIdHigh = 0x0100 << 5;
      CAN_FilterInitStructure.CAN_FilterIdLow = 0x0000;
      CAN_FilterInitStructure.CAN_FilterMaskIdHigh = 0x0700 << 5;
      CAN_FilterInitStructure.CAN_FilterMaskIdLow = 0x0000;
      CAN_FilterInitStructure.CAN_FilterFIFOAssignment = 0;
      CAN_FilterInitStructure.CAN_FilterActivation = DISABLE;
      CAN_FilterInit(&CAN_FilterInitStructure);

//  CAN_Init(&CAN_InitStruct);

    /* Enable IT on USART handler */
    CAN_ITConfig(CAN_IT_RQCP0, ENABLE);
    CAN_ITConfig(CAN_IT_FMP0, ENABLE);


